Revit 2026 API

# LineProperties Properties

---

The LineProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color | The current color used when drawing lines/curves. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LineWidth | The current width (thickness) of the pen stroke when drawing lines/curves. |
|  | PatternId | Id of the current Line pattern element used when drawing lines/curves. |
|  | Transparency | The current transparency level to be applied to the current color. |

#### Reference

LineProperties Class

Autodesk.Revit.DB Namespace